{"meta":{"title":"DECENTRAWISE","subtitle":"Building blockchains, smart-contracts, dapps and changing the world as we know it...","description":"Decentralization Experts","author":"DECENTRAWISE","url":"https://decentrawise.com","root":"/"},"pages":[{"title":"Audit","date":"2020-07-25T10:27:12.250Z","updated":"2020-07-25T10:27:12.250Z","comments":true,"path":"audit/index.html","permalink":"https://decentrawise.com/audit/index.html","excerpt":"","text":"Been there, done that… With our several years of experience in blockchain and smart-contract development, our team of experts has all the strengths needed to deliver world class code audits for code quality, security and vulnerability checks. Having been on both sides of the fence, from developing and requesting code audits and also auditing other parties code, on both Ethereum and EOSIO projects, our team can help in the full spectrum of your decentralized application development, bringing value to your deliverables by reviewing and deeply analysing them to the highest industry standards. We want to know about your project, so please reach out to us here"},{"title":"Contact","date":"2020-07-25T10:25:07.472Z","updated":"2020-07-25T10:25:07.472Z","comments":true,"path":"contact/index.html","permalink":"https://decentrawise.com/contact/index.html","excerpt":"","text":"The easiest way to reach out to us is probably our Telegram group. Drop us a line there and we’ll get back to you as soon as we are online… You can also follow our blog posts here and on Twitter to always be informed of the latest news. If you really want to write us a letter, we don’t use FAX anymore, so please try to reach to us by email at info[at]decentrawise[dot]com Thanks for reaching out!"},{"title":"Development","date":"2020-07-25T10:22:59.756Z","updated":"2020-07-25T10:22:59.756Z","comments":true,"path":"development/index.html","permalink":"https://decentrawise.com/development/index.html","excerpt":"","text":"We focus on Blockchain and DApp development since 2016. Having developed some very successful dapps in these last years gives us the experience and know-how to be the perfect partner for your decentralized development needs. The main areas we have been working on are: Ethereum smart-contract development (Solidity) EOSIO smart-contract development (C++) IPFS decentralized storage (Go/Javascript) Dapp frontend development (HTML5/Javascript) Blockchain core development (C++) Deployment and infrastructure tools (Bash/Javascript) Testing and coverage (Javascript) Having deployed in all major networks, and having a strong focus on the development of truly decentralized platforms, we can’t wait to know what is your idea and build from there! Please reach out to us here"},{"title":"Infrastructure","date":"2020-07-25T10:18:24.236Z","updated":"2020-07-25T10:18:24.236Z","comments":true,"path":"infrastructure/index.html","permalink":"https://decentrawise.com/infrastructure/index.html","excerpt":"","text":"Our team has many years of experience in DPOS blockchain infrastructure, running bare metal high end servers participating in block production in many public networks, from Bitshares to Steem, or Hive after the fork and also on many EOSIO chains. Our datacenter is located in Portugal and we want to contribute as much as we can to decentralization of the entire planet, so looking forward to support as many public networks as possible! Let us know about your new chain and we’ll most probably support it with our boxes! Please reach out to us here"},{"title":"Projects","date":"2020-07-25T10:16:22.035Z","updated":"2020-07-25T10:16:22.035Z","comments":true,"path":"projects/index.html","permalink":"https://decentrawise.com/projects/index.html","excerpt":"","text":"We participate in many clients projects that, due to NDA restrictions, we cannot disclose here. Although, here is a small list of some of the public projects that we have contributed to in the last years: Decentralized applications Decentralized protocols Blockchain networks"},{"title":"Team","date":"2020-07-25T09:49:36.788Z","updated":"2020-07-25T09:49:36.788Z","comments":true,"path":"team/index.html","permalink":"https://decentrawise.com/team/index.html","excerpt":"","text":"Our team varies from project to project and the governance is mainly DAC (decentralized autonomous community) oriented on a per project basis. We run our projects with a SCRUM mindset, giving the complete autonomy to each team member to self-manage, as is the rule in most open source communities. In order to facilitate the communication with clients all projects have a single product owner (PO), and are run under the technical supervision of Pedro Reis Colaço (prc), our lead technology researcher and developer, due to his experience in the blockchain, peer-to-peer and decentralized systems and broader experience in software engineering. We defend that engineers in this space have a very important role in defining the next generation of our global economic system, with all its impact in peoples lives, so our involvement in any project also depends on its alignment with each team members perspective and values. We work everyday to make the world a better place for all humanity! This will always be our vision and main focus, despite any economic or political incentive."},{"title":"Talks","date":"2020-07-25T10:08:56.089Z","updated":"2020-07-25T10:08:56.089Z","comments":true,"path":"talks/index.html","permalink":"https://decentrawise.com/talks/index.html","excerpt":"","text":"Our team has many years of experience in blockchain, peer-to-peer and decentralized systems, and has been working in this emerging industry, in many successful projects, since 2016, so many conferences, summits and other events invite us to speak, and many of our team members are available to speak at events. But mainly Pedro Reis Colaço (prc), our lead technology researcher and developer, is available to speak at keynotes, talks, panels, master classes and workshops, both online and on-site, and deliver high value industry knowledge lived in first person, ranging from blockchain technology to emerging decentralized finance, passing by smart-contract development or security audits and standards. Being a native or fluent speaker of both Portuguese, English and Spanish, he is able to perform in any of these languages, making him a very versatile speaker. All our talks are written exclusively for each event, depending only on its theme. The state of the art dictates the focus and usually there is space for some improvising as well. We will provide a presentation in pdf format, that is copyrighted material and will not be distributed, so it must be deleted after the talk from the presentation equipment. Due to the high demand, we respectfuly have to limit our availability to participate in so much events per year, due to other commitments in other areas, so we expect your understanding if we don’t have a slot available. Presence minimum requirements: Travel expenses (our crew is at least 2 adults, depending on the format and event type) Accommodation and meals (all crew) for the entire event, plus day before and day after Full passes for all crew members to the entire event Speaker fees:These depend on the event type, speaking format, length of presentation, event ticket price, expected audience and location, so please provide these details when contacting for a quote. We can consider speaking for free, providing at least the minimum requirements are taken care of, in case the event ticket price is completely free as well. Sponsorship of events:Please understand that we are a decentralized team, that works on decentralized autonomous community projects and open source software, so we don’t have any product or service to sell or promote. Let us know about your event and theme… We are looking forward to it! Please reach out to us here"}],"posts":[{"title":"DSound v0.4.3","slug":"dsound-v0-4-3","date":"2020-03-30T23:00:00.000Z","updated":"2020-07-22T20:47:07.848Z","comments":true,"path":"development/dsound-v0-4-3/","link":"","permalink":"https://decentrawise.com/development/dsound-v0-4-3/","excerpt":"","text":"Original post on Hive Hello HIVE! New features and strategyDSound has a few announcements to make and also moved to HIVE, so you can now experience the new chain with DSound as well! But this is not the only thing that is new on DSound, so please read on… :) What’s new in DSound version 0.4.3?Well, so much… but let’s start with the more apparent things… DSound new domain dsound.ioThis will be the new home for DSound from now on. All the new things DSound will happen here! Everything has been ported, besides the few things that occurred from March 20th til today. But all accounts will need to log back in, as this domain is new… Old dsound.audio domain deprecationThat’s right, the old domain dsound.audio still contains the old app and is still connected to STEEM blockchain. The use of this domain and app is deprecated - you should move as soon as possible to the new DSound on dsound.io, as the old app will be shutdown after April 15th, and will begin pointing to the new DSound from there on… HIVE as the new Blockchain behind DSoundThis was a very difficult decision to be made… We all lost a bit of us with this departure from STEEM! :( But, what really made us put things in perspective and move on was DSound name: the letter D of DSound means decentralized and since its inception back in 2017 DSound has been the most decentralized sound media platform in the world! With the latest developments of the STEEM takeover, which we don’t want to even start a convo on, it has shown that a single party had taken the control of a significant part of the chain, by placing most of the “elected” witnesses under their control. This situation has shown that DPOS chains have a degree of resilience never tested before: Hard fork the hell out of centralization! :D As most of the STEEM stakeholders, we also were very worried about the outcome of such an event, but now we have proof that it was a success! We don’t mean that HIVE will be more valuable or less then STEEM, that is not the question. What is really important is that there’s no network capable of keeping its community hostage for long! As of now, STEEM has maintained this degree of centralization, and even made it worse, so DSound doesn’t fit that network. Let’s see what that community brings to the table in the future, but for now we moved on to the place that our community created as a consequence, and that so far has exceeded our expectations, and this is HIVE! DSound HIVE CommunityDSound HIVE Community has been created, with all bees and dsounders in our mind! :) Please check it out here: DSound Community You can also subscribe to stay in the loop about all new things DSound will bring… All content published in DSound can be posted on the DSound Community or on the author Profile Page or blog. Of course, a content published in DSound Community will reach more people and attract more curation, so we also enabled author repost that content on his blog, if he so wishes by pushing the repost button on the published content. We will be integrating other communities that will be evolving in the future, as long as they bring more value and recognition to our users, but for now this communities HIVE feature is too recent to evaluate, so DSound only supports it’s own community for now. If you represent a community, reach out to us and we can start a chat about that integration… Post to DSound Community or User ProfileYou already know, no more bloat to your blog if you have many other blog posts that are not music or audio related! But if you want to you can still post to your profile… The default is to post on the DSound Community, but just change the drop-down selection next to the publish button when posting on DSound. Better SEO (Search Engine Optimisation) for DSound contentSince the DSound focus will be user acquisition and retention, it makes sense that DSound turns more SEO friendly. No more strange URLs with #! in them… But this is only the beginning, many other improvements will follow to bring DSound to the masses. Many documentation and marketing assets will be added to DSound platform to make it more usable and make new users more “at home” with crypto. Fixes to Sound Engine and better playback on devicesThe DSound native sound engine has evolved and is now capable of cope with more restrictive browsers, like iOS, and even continue playback when the browser is not in foreground. Still some work to improve the usability, but if you used iOS you’ll notice the difference! Even in Chrome if you placed a tab in background, when the current track ended the next would refuse to start… not anymore. :) Author keeps more rewards nowDSound takes a share of the post revenue, it has been like that since day one. It has been part of DSound business model, but today we announce that this will not be 25% anymore! From today on, the fee taken by DSound on any post is capped at 5%! But there’s more! We now have communities and DSound will grant it’s community or any other approved community a 2.5% revenue share as well. So, to clarify, here is a table of how the revenue will be shared: Post Type Author/Curation Community DSound Poster DSound Community 92.5% 2.5% 5% — Approved Communities 92.5% 2.5% 5% — User Profile 95% 0% 5% — Cross-post 90% 5% 0% 5% Repost — — — — So our artists, content creators, communities and curators will have more room to build their strategies and DSound team will concentrate more on the development side and less on curation. DSound new business strategyThe business strategy of DSound will be more on the front of bringing more people to DSound, by leveraging social media integration and building more features to ease the new user on-boarding. The user attention is the currency on DSound, and our focus with the new IPFS network is to evolve DSound into a platform where that attention is incentivised to the max potential. Also by reinvesting in the community we envision that a positive feedback loop can be created and all incentives will be aligned to discover more great content and make it more available to more consumers. We’ve been experimenting with many strategies and we’ll start to deploy those that we felt that had the potential to bring more value to DSound platform and its users in the long run. We’re not here to make a quick buck. Our passion is to change the music industry for good, not just implement the same industry over blockchain! We think that we know how to do that, and it will be a lot of work, but that’s what makes us get up in the morning anyway! :) DSound Community WitnessThe @dsound witness was ported to HIVE and is already producing and validating blocks on HIVE blockchain since the beginning of the fork. This witness effort is comparable as other community initiatives that launch a witness node to promote network security and generate revenue. In @dsound witness 100% of the rewards will be kept in @dsound account and used to vote the best rated posts in the DSound Community. The mechanism of evaluation will be based on attention generated by each post, and is still in design along with other DSound features, but the important thing is that 0 HIVE will move out of the @dsound account or power down - all revenue generated will be reinvested in the community by curation, either direct or through other approved music communities. Please check below how to vote for the Community witness… Start of the rollout of the new DSound IPFS networkThe most important thing that we’ve been working on during this crypto winter has been the new DSound IPFS network. This version includes the basis for the rollout of the new network, and will be happening in the following months… This new network will continue and improve the DSound ethos, as a 100% decentralized sound media sharing network, and expand its capabilities to things never thought possible. Stay tuned for the next versions… ;) What is in the roadmap for DSound future? New IPFS network Distributed streaming of content Integrate other music curation communities Cross-post feature for other communities Account-less on-boarding Integrate with the best signer technology Integrate other blockchains and monetization strategies Post content from other sources UI improvements and mobile first Improvements to listening experience Playlists and playlist monetization Instant tips for artists while listening and many, many more… the order of this list is not related to time at all… features will come out as they become stable and there is a demand for them. This is just a snapshot of some things that might be coming to DSound… But, still don’t know what DSound is?It’s ok… You are at the right place! Let’s share what it is with you right now… What is DSound?DSound is a decentralized web application that allows anyone to upload, listen and discover music and other sounds stored on top of the IPFS Network. It uses HIVE blockchain as a persistent database, so by posting their sounds the authors can earn rewards in cryptocurrency when other users like their content, which can be exchanged easily to US Dollars, Euros or any other currency, with a look and feel very similar to Soundcloud. Check DSound Intro post for more detailsDSound Discord ServerThe DSound discord server is being discontinued in favour of DSound HIVE Community! We’ll be using our DSound Community for concentrating all DSound communication in the same place now… If you need any help, please post in our community and any other members or our moderators will guide you… @prc@juliakponsford@jeffandhisguitar@darrenclaxton DSound TelegramIf you need to chat with us or with other DSound users, please join us at our DSound.io Telegram We are very happy to chat there and our community will also be there to help anyone out… DSound is this! &lt;3 “Music is what feelings sound like”DSound &lt;3 Music","categories":[{"name":"development","slug":"development","permalink":"https://decentrawise.com/categories/development/"}],"tags":[{"name":"projects","slug":"projects","permalink":"https://decentrawise.com/tags/projects/"},{"name":"dsound","slug":"dsound","permalink":"https://decentrawise.com/tags/dsound/"},{"name":"music","slug":"music","permalink":"https://decentrawise.com/tags/music/"},{"name":"ipfs","slug":"ipfs","permalink":"https://decentrawise.com/tags/ipfs/"},{"name":"hive","slug":"hive","permalink":"https://decentrawise.com/tags/hive/"}]},{"title":"Supporting Hive fork","slug":"supporting-hive-fork","date":"2020-03-20T00:00:00.000Z","updated":"2020-07-22T20:21:06.919Z","comments":true,"path":"infrastructure/supporting-hive-fork/","link":"","permalink":"https://decentrawise.com/infrastructure/supporting-hive-fork/","excerpt":"","text":"Original post on Steem Witness nodes updated to v0.23.0 - Hello HIVE family! All Steem nodes are updated… Goodbye Justin Sun, hello HIVE family! :) All nodes running 0.23.0 (Hive network fork)The last update was not easy to decide… but actually this one was soooo easy! And Justin Sun made it so much easier with the insane moves his team made lately… ;) I am totally against any violent or forced restriction to any one’s property, and being an anarchist and libertarian myself, I only decided for this move because we reached a position of either him or us… and I choose us! I think that the vast majority of my STEEM pals will move to HIVE so, as a token holder and network participant with some witness nodes under my supervision, I decided to move on with this hardfork and support the new HIVE Network! @dsound and @prc witness nodes are running v0.23.0, so ready for HF23 HIVE hardfork in some hours… I think that it is a very important responsibility of a Witness to check the code and the changes introduced in a new version of the blockchain code. I do it all the time an update comes about, and only after that I decide if I will upgrade to it or not, so I reviewed the code changes as well. What we’re working onCurrently we’re working on DSound first “beta” release, that will be out soon, and a complete new business model and economy for DSound… Loads of news very soon, so keep tuned my friends! ;) We are building the evolution of DSound while the crypto winter has pushed away so many great people from our 9000+ community, and also gave us more indicators to re-think our vision, business strategy and the path we want to go to achieve our goals as a team and community leaders…","categories":[{"name":"infrastructure","slug":"infrastructure","permalink":"https://decentrawise.com/categories/infrastructure/"}],"tags":[{"name":"projects","slug":"projects","permalink":"https://decentrawise.com/tags/projects/"},{"name":"steem","slug":"steem","permalink":"https://decentrawise.com/tags/steem/"},{"name":"witness","slug":"witness","permalink":"https://decentrawise.com/tags/witness/"},{"name":"bp","slug":"bp","permalink":"https://decentrawise.com/tags/bp/"},{"name":"dpos","slug":"dpos","permalink":"https://decentrawise.com/tags/dpos/"},{"name":"hive","slug":"hive","permalink":"https://decentrawise.com/tags/hive/"}]},{"title":"Steem Protection soft fork","slug":"steem-protection-soft-fork","date":"2020-02-26T00:00:00.000Z","updated":"2020-07-22T20:13:34.499Z","comments":true,"path":"infrastructure/steem-protection-soft-fork/","link":"","permalink":"https://decentrawise.com/infrastructure/steem-protection-soft-fork/","excerpt":"","text":"Original post on Steem STEEM nodes updated to v0.22.2, but why? Yes, this last update was not easy to decide. ;) I am totally against any violent or forced restriction to any one’s property, and being an anarchist and libertarian myself I had to dig really deep into this chain update, understand it’s motivations and decide if I would support it or not… At first I was against it, as I was back last year when the same was being proposed against @ned and @steemit inc. I think that blockchain immutability and censorship resistance is key to it’s existence, alongside it’s decentralized nature. But I kept myself in the loop digging further, to understand better what was going on and what motivations were guiding these actions, as a token holder and network participant with some witness nodes under my supervision. But what changed my mind? Coindesk’s article and @lukestokes youtube videoThanks to this article and this video: I clearly understood the motivations behind this update, and got to know about the March 6th town hall, as well as @justinsunsteemit reply to this community driven change, which made much more sense to me. Steem nodes running 0.22.2I hope not to regret having made this decision, but facing the facts I described I think it makes sense to temporarily restrict access to the misuse of that stake that could impact the whole community, and participate in the discussion on the upcoming town hall to decide further actions. In the case that no meaningful decisions come from the March 6th meeting, I may consider reverting my nodes back to 0.22.1, if I find that other, less honourable, motivations are behind this temporary protection measure. I think that it is a very important responsibility of a Witness to check the code and the changes introduced in a new version of the blockchain code. I do it all the time an update comes about, and only after that I decide if I will upgrade to it or not, so I reviewed the code changes as well. What we’re working onCurrently we’re working on DSound first “beta” release, that will be out soon, and a complete new business model and economy for DSound… Loads of news very soon, so keep tuned my friends! ;) We are building the evolution of DSound while the crypto winter has pushed away so many great people from our 9000+ community, and also gave us more indicators to re-think our vision, business strategy and the path we want to go to achieve our goals as a team and community leaders…","categories":[{"name":"infrastructure","slug":"infrastructure","permalink":"https://decentrawise.com/categories/infrastructure/"}],"tags":[{"name":"projects","slug":"projects","permalink":"https://decentrawise.com/tags/projects/"},{"name":"steem","slug":"steem","permalink":"https://decentrawise.com/tags/steem/"},{"name":"witness","slug":"witness","permalink":"https://decentrawise.com/tags/witness/"},{"name":"bp","slug":"bp","permalink":"https://decentrawise.com/tags/bp/"},{"name":"dpos","slug":"dpos","permalink":"https://decentrawise.com/tags/dpos/"}]},{"title":"EOSIO efficiency experiments","slug":"eosio-efficiency-experiments","date":"2019-12-10T00:00:00.000Z","updated":"2020-07-25T11:31:58.147Z","comments":true,"path":"development/eosio-efficiency-experiments/","link":"","permalink":"https://decentrawise.com/development/eosio-efficiency-experiments/","excerpt":"","text":"Minimizing impact of multi_index updates in cycles in CPU usage We were requested to do an efficiency audit on some EOSIO smart-contract code for a dapp and we were quite shocked with the amount of nested cycles they had around a user table, each iteration making its own modifications to some of the users. Knowing that multi_index.modify() is a bit expensive, that implementation would consume a huge CPU and would possibly fail with some higher number of users, exceeding the limit of CPU usage per transaction on EOSIO. At first we would suggest a complete rewrite, but that code was so confusing and inter-dependent that even that would require a complete redesign of the logic itself, not just the implementation. This is usualy the problem with copy/pasted “spagetti” code, so we decided to make some experiments around multi_index tables and see if we could get some improvements out of it. Initial stateThe start of this experiment had these results for a thousand table writes of an uint64_tfield:12345678910111213$ eoslime test Test profile contractCPU: 354 NET: 184 ✓ update John Doe profile (140ms)CPU: 283 NET: 192 ✓ update Jane Doe profile (185ms)CPU: 12009 NET: 104 ✓ John Doe count one thousand (228ms)CPU: 14588 NET: 104 ✓ Jane Doe count one thousand (213ms) 4 passing (3s) meaning that between 12ms and 14.5ms were being billed for the “count one thousand” actionCPU when using a multi_index table. These values come from the transaction receipt, so theyare the most accurate possible according to the eosio internal accounting. Routes identified: Tables caching Smart tables … Tables cachingThe idea is cache the reads/writes from/to multi_index tables into a cache map, so thatmany reads of the same object just require one deserialization an many writes to the sameobject only do one final serialization and write to eosio RAM. The final results from the same operations are:12345678910111213$ eoslime test Test profile contractCPU: 390 NET: 184 ✓ update John Doe profile (197ms)CPU: 342 NET: 192 ✓ update Jane Doe profile (237ms)CPU: 10602 NET: 104 ✓ John Doe count one thousand (194ms)CPU: 11437 NET: 104 ✓ Jane Doe count one thousand (202ms) 4 passing (3s) So this experiment took the CPU billing ~ 10% lower, and this could be improved a bit byusing an unordered_map instead of a map, which is sorted by nature, but the unordered_mapcontainer in eosio is faulty, as you can check in this github issue of EOSIO.CDT. So turns out that there’s not much difference, from the efficiency point of view, of usingmulti_index tables and maps. Smart tablesThe idea is to make tables lazy, by using a deque to store the all entries and flushthe contents of of the cache when the object is destroyed, performing only one write to themulti_index table per each entry in the cache that was modified. You can check the code for this experiment in eosio-smart-table repo. The final results from the same operations, even multiplied 10x the cycles, are as follows:1234567891011121314151617$ eoslime test Test profile contractCPU: 346 NET: 184 ✓ update John Doe profile (114ms)CPU: 408 NET: 192 ✓ update Jane Doe profile (134ms)CPU: 2961 NET: 104 ✓ John Doe count one thousand (186ms)CPU: 27497 NET: 104 ✓ Jane Doe count ten thousand (151ms) 4 passing (3s) Please notice that for one thousand updates the difference in efficiency is around 5x (80%saving on billed CPU), but it is also non linear, so for ten thousand (10x more) the totalCPU billed only grew by less than 9x. smart_table limitations only supports primary key, no other indexes focus on modify optimization, so other operations like emplace are not optimized right now it fills all the internal cache all at once, might be interesting toimprove reading in chunks for large datasets Statistics helper wrappersIn order to identify how many operations were being executed and which, we also included some stats wrappers. smart_table_stats multi_index_stats singleton_stats These wrapper provide operation counters for specific functionalities of each of the base classes,so that we can measure what is going on on some intensive code and decide if it makes sense to usesmart_table or not. ConclusionsThere’s a lot of room to improve efficiency of smart contract code. multi_index tables areexpensive in CPU but are well optimized facing STL counterparts like std::map. Where we canget more benefits in terms of efficiency is to minimize the writes by using internal structuresthat do not require hashing/sorting, like std::vector or even better std::deque, if we donot require traversing the data in a single contiguous data block. Possible future improvements (TBC) full test suite cache filling and flushing in chunks perform operations over current loaded chunk of data, using lambda for instance Hope this shows the importance of optimization and also sheds some light on the internals ofeosio and what/where we can improve.","categories":[{"name":"development","slug":"development","permalink":"https://decentrawise.com/categories/development/"}],"tags":[{"name":"projects","slug":"projects","permalink":"https://decentrawise.com/tags/projects/"},{"name":"eosio","slug":"eosio","permalink":"https://decentrawise.com/tags/eosio/"},{"name":"smart-contract","slug":"smart-contract","permalink":"https://decentrawise.com/tags/smart-contract/"},{"name":"efficiency","slug":"efficiency","permalink":"https://decentrawise.com/tags/efficiency/"},{"name":"testing","slug":"testing","permalink":"https://decentrawise.com/tags/testing/"}]},{"title":"DTube token sale","slug":"dtube-token-sale","date":"2019-09-28T23:00:00.000Z","updated":"2020-07-22T19:34:35.826Z","comments":true,"path":"market/dtube-token-sale/","link":"","permalink":"https://decentrawise.com/market/dtube-token-sale/","excerpt":"","text":"Original post on Steem Why I decided to buy some DTube Coins (DTC) in this 1st sale round?Some of you might know already but some surely don’t. DTube is running the 1st round of their token sale now, started last week, and it is being available for Steem community mainly. I just decided to buy up some DTC (D.Tube Coins) myself, and want to share with all of you why I did it, so that you might also consider getting in for their token offer. DISCLAIMER I do not provide personal investment advice and I am not a qualified licensed investment advisor. I am an amateur investor. All information found here, including any ideas, opinions, views, predictions, forecasts, commentaries, suggestions, or stock picks, expressed or implied herein, are for informational, entertainment or educational purposes only and should not be construed as personal investment advice. While the information provided is believed to be accurate, it may include errors or inaccuracies. I will not and cannot be held liable for any actions you take as a result of anything you read here. Conduct your own due diligence, or consult a licensed financial advisor or broker before making any and all investment decisions. Any investments, trades, speculations, or decisions made on the basis of any information you got from me, expressed or implied herein, are committed at your own risk, financial or otherwise. This is my personal blog. It reflects my own views, ideas and opinions. It is not affiliated with any broker/dealer or registered investment advisor. No representations or warranties are made with respect to the accuracy or completeness of the information provided here, including any links to other sites. The links provided are maintained by their respective organizations and they are solely responsible for their content. All information presented here is provided ‘as is’, without warranty of any kind, expressed or implied. Now that we took all the legal implications out of our way, let’s get to it… D.Tube Coin (DTC)You can find more information about DTC and the new D.Tube economy here. I found particularly interesting this article from @heimindanger (D.Tube creator) blog here on Steemit, that led me to rethink about the proposed incentivisation (we have chatted about these a while back when he was developing Avalon bockchain) and the cool details that he describes in more detail there. I want to make this post as spot on as possible, so let’s jump right into TL;DR mode… :) TL;DR (why I decided to buy some DTC in this 1st sale round?) It’s D.Tube (DISCLAIMER: I am NOT by any means affiliated with D.Tube, nor are they contracting or sponsoring me for sharing this) D.Tube is the only truely decentralized video platform in the world (as happens with DSound) Their own incentivisation mechanics for DTC mix well with Steem ones, in my opinion creating a nice sinergy for the creators and curators in the platform I am a friend of @heimindanger and part of the D.Tube community since day one, as they inspired me to build DSound I have total confidence of the motivations that drive D.Tube core team, with whom I share many of their vision and goals for DSound In the next weeks I will launch my own node of D.Tube blockchain, to help out the testnet and provide a bit more decentralization to the network They will be airdropping 50% of the token supply to existing users and people that participate in the token sale Successful projects need funding, so if we believe that the project brings value to Steem and to blockchain in general, then we should think about participating in the funding of such projects, not just waiting for free airdrop money The more funding they get from the 25% of the supply that is going to be sold in IEO, the less sell pressure will be needed to raise funding for future development, so higher value for the token in the future The next rounds of their IEO will be held on a major exchange (their words, no insider knowledge here), so they assure that the price of this 1st round will be the lowest of all (click the link to get to the sale page) Only one million DTC is available for this 1st sale round, out of the 25 million tokens for IEO and a total supply of only 100 million DTC, more on the token economics here Potential token value increase from IEO on exchange and token burning in the economy, combined with variable inflation directly proportional to the value created on the platform, thus reducing dilution, are good metrics for investment Great hedge for your Steem tokens during this still bearish trend I got my share, will you miss this opportunity? Who is @prc? I am a life long Software Developer, working on Blockchain for last years on several projects, but I am also a DJ and Electronic Music Producer, my alter-ego “Kolatz” that you can browse for if interested… :) I am the creator of DSound, which was the first and still the only completely decentralized sound platform in the world, that continues helping musicians and sound creators around the globe to monetize their content besides the state of the crypto economy actually, and the next release will be the first “beta” release with loads of new features! :) If you got curious about DSound, please check it out: https://dsound.io","categories":[{"name":"market","slug":"market","permalink":"https://decentrawise.com/categories/market/"}],"tags":[{"name":"projects","slug":"projects","permalink":"https://decentrawise.com/tags/projects/"},{"name":"dtube","slug":"dtube","permalink":"https://decentrawise.com/tags/dtube/"},{"name":"token","slug":"token","permalink":"https://decentrawise.com/tags/token/"}]},{"title":"DSound v0.4.1","slug":"dsound-v0-4-1","date":"2018-12-08T00:00:00.000Z","updated":"2020-07-22T18:57:33.242Z","comments":true,"path":"development/dsound-v0-4-1/","link":"","permalink":"https://decentrawise.com/development/dsound-v0-4-1/","excerpt":"","text":"Original post on Steem Update to HiveMind API and several bug fixes and much more to come!Today we published a small update for DSound, the third in 2018! This is just an intercalar update needed due to the latest changes announced by Steemit, Inc. related to HiveMind new API.Many more updates to come with loads of cool stuff! :) What is DSound?DSound is a decentralized web application, developed in Javascript and React, that allows anyone to upload, listen and discover music and other sounds stored on top of the IPFS Network. It uses STEEM blockchain as a persistent database, and by posting the sounds the authors can earn rewards in STEEM cryptocurrency, when other users like their content, which can be exchanged easily to US Dollars, Euros or any other currency, similar to Steemit.com for blog posts. Check DSound Intro post for more detailsAbout @dsound delegations and curationMy huge thank you to everybody who delegated to @dsound! It makes a huge deal for the curation effort! :) Due to these, DSound is able to continue spreading love to our hundreds of content creators and to support many music contests and similar events on the Steem blockchain. The Top DelegatorsBesides our institutional delegators, these guys are the top 10 delegators as of today: @toddjsmith1979 @vachemorte @theturtleproject @freetousesounds @harrisonmir @atomcollector @isaria @humanabstract @polarity @terranoise Please go check out these guys! They are artists and content creators in DSound that want to support the curation effort… Thanks a lot guys for giving back to the platform! :) And to all the other people that didn’t delegate yet, please do so… It is very important to build a strong curation account to build up our power to keep this platform with great incentives to our artists and sound creators! Curation teamIt’s great to see that our curation efforts continue to produce great results! :) It is such a big deal for us, as curators in the platform, to get to the Trending or Hot pages and see only great content coming out of DSound, with such proportionate and interesting payouts. We’re really proud of the achievements of curation in these last months… DSound is this! &lt;3 DSound Discord Server (the tribe gets connected)If you’re learning about DSound now or you didn’t connect yet, please join our Discord server at: https://discord.gg/hSsBw3b There you’ll find a few channels to have everybody from our community getting together and making DSound even better. We invested a significant effort in organizing this community server and now we have rules, a set of channels where people have great chats, or support help and suggestion of features… Thanks to all participants! Thanks also to our moderators who have done a great job in keeping this a great place to hang out! Also check their work on DSound since they are content creators as well: @maelstrohmblack@juliakponsford@jamesub@archaimusic@jamesub@jeffandhisguitar@darrenclaxton The steemit.chat channels continue but are only checked from time to time now… What’s new in DSound v0.4.1?So now are you ready to find out what else is packed in this new release? Just grab a cup of coffee, sit down and relax… New IPFS Nodes spread globally and instant playbackIn the last release we implemented DSound’s own IPFS nodes network, that counts with nodes spread around the globe for faster access and availability: We confirm that the effort was successful and that now all content on DSound has become more accessible and plays instantly on every part of the planet! :) We were able to identify the areas of major load and will be deploying a few more nodes soon, so that we keep our network of IPFS nodes seeding and rotating content maintaining the desired availability for at least two weeks. It might be longer in periods of lower volume. This will also enable the new developments already in preparation for the first beta and it will extend the way content might be hosted forever in other ways, more on that soon… ;) HiveMind updatesThe introduction of HiveMind by Steemit, Inc. required some changes on the way DSound communicates to the Steem blockchain. These were minor changes in the format or naming of API calls, but enough to have turned DSound useless if not taken care before the live deployment of such a service. We were able to test these changes in the test bed that Steemit, Inc. provided, as we are in a not much common timezone and so the test node was more or less accessible at the times we were testing all the functions. This enabled a smooth transition without any problems so far. If you notice anything strange, please report back to our Discord server above, so that we can resolve it faster. Several minor bug fixes and improvementsMinor fixes here and there, like comments now show the correct votes and payout after the 7 days and improvement in the feed page for each logged-in user… What about the first Betarelease?The development of the first beta (v0.5) continues as scheduled! :) This intercalar release was due to external requirements and we plan to have one or two more with some urgent fixes and improvements and then early next year we will launch the so desired first beta release… Big changes and improvements take time. We want all of you to understand that we are building a lot of cool features and we want to have them ready for you the earlier possible. These intercalar releases will make DSound better and more functional to you in the meantime, and we’ll continue pushing the release of the first beta the earlier we can in 2019, maybe even in January, we hope! I announced what is comming on SteemFest3, did you see my presentation? If not here it is for you to check out: Final wordsOnce again DSound is one step closer to be the platform that frees us all and allows us to do what we love: music, sound design, recording, remixing, mashups, podcasts, or whatever is your thing… :) We are starting to implement a few marketing initiatives. Please like our new DSound Facebook page to make it more visible to the masses! We took some goodies to SteemFest3 and other events, like some DSound stickers: In our trip to SteemFest3 we shared some of these all over the six countries and 7 cities we passed by! Many new people will learn about DSound in the next months hopefully! :) Please pass the word to your friends! If they produce great content, they will produce even better in DSound! ;) TL;DRMany thanks to all DSound delegators. It is such a big deal for us, as curators in the platform, to continue to get to the Trending or Hot pages and see only great content coming out of DSound, with such proportionate and interesting payouts. Join DSound Discord server to stay up to date and access support. We will be expanding the DSound’s own IPFS nodes network, that counts with nodes spread around the globe for faster access and availability. We successfully implemented the changes needed to transition smoothly to HiveMind, as required by Steemit, Inc. Minor fixes here and there and improvements. Shared DSound presentation at SteemFest3. Thanks a lot to all fellow members of DSound tribe, all steemians, developers and music addicts like me for your support and encouragement on this project! Peace! :) “Music is what feelings sound like”DSound &lt;3 Music","categories":[{"name":"development","slug":"development","permalink":"https://decentrawise.com/categories/development/"}],"tags":[{"name":"projects","slug":"projects","permalink":"https://decentrawise.com/tags/projects/"},{"name":"dsound","slug":"dsound","permalink":"https://decentrawise.com/tags/dsound/"},{"name":"music","slug":"music","permalink":"https://decentrawise.com/tags/music/"},{"name":"ipfs","slug":"ipfs","permalink":"https://decentrawise.com/tags/ipfs/"},{"name":"steem","slug":"steem","permalink":"https://decentrawise.com/tags/steem/"}]},{"title":"DSound presentation at SteemFest 3","slug":"dsound-steemfest3","date":"2018-12-01T00:00:00.000Z","updated":"2020-07-24T15:01:48.865Z","comments":true,"path":"talks/dsound-steemfest3/","link":"","permalink":"https://decentrawise.com/talks/dsound-steemfest3/","excerpt":"","text":"Kraków, November 2018 Creator of DSound (@prc) presentation. If you were not at SteemFest 3, then you can watch it here… You can check out DSound at: dsound.audio And… Much more news to come soon! Stay tuned DSound Tribe! Enjoy! :)","categories":[{"name":"talks","slug":"talks","permalink":"https://decentrawise.com/categories/talks/"}],"tags":[{"name":"projects","slug":"projects","permalink":"https://decentrawise.com/tags/projects/"},{"name":"dsound","slug":"dsound","permalink":"https://decentrawise.com/tags/dsound/"},{"name":"music","slug":"music","permalink":"https://decentrawise.com/tags/music/"},{"name":"ipfs","slug":"ipfs","permalink":"https://decentrawise.com/tags/ipfs/"},{"name":"steem","slug":"steem","permalink":"https://decentrawise.com/tags/steem/"}]},{"title":"DSound v0.4","slug":"dsound-v0-4","date":"2018-11-04T00:00:00.000Z","updated":"2020-07-22T17:35:29.412Z","comments":true,"path":"development/dsound-v0-4/","link":"","permalink":"https://decentrawise.com/development/dsound-v0-4/","excerpt":"","text":"Original post on Steem New IPFS Nodes spread globally, instant playback, higher curation votes, post formatting, several bug fixes and much more to come!You waited patiently for DSound new version and here it is! This is the second release of 2018, and the last release before the first Beta, packed with loads of cool stuff! :) What is DSound?DSound is a decentralized web application, developed in Javascript and React, that allows anyone to upload, listen and discover music and other sounds stored on top of the IPFS Network. It uses STEEM blockchain as a persistent database, and by posting the sounds the authors can earn rewards in STEEM cryptocurrency, when other users like their content, which can be exchanged easily to US Dollars, Euros or any other currency, similar to Steemit.com for blog posts. Check DSound Intro post for more detailsAbout @dsound delegations and curationMy huge thank you to everybody who delegated to @dsound! It makes a huge deal for the curation effort! :) Due to these DSound is able to continue spreading love to our hundreds of content creators and to support many contests and similar events on the Steem blockchain. The Top DelegatorsBesides our institutional delegators, these guys are the top 10 delegators as of today: @vachemorte @theturtleproject @freetousesounds @harrisonmir @atomcollector @humanabstract @polarity @terranoise @danstatus @jonmagnusson Please go check out these guys! They are artists and content creators in DSound that want to support the curation effort… Thanks a lot guys for giving back to the platform! :) And to all the other people that didn’t delegate yet, please do so… It is very important to build a strong curation account to build up our power to keep this platform with great incentives to our artists and sound creators! Higher curation votesThe current low value of STEEM has had an impact on the use of Steemit as well as many of the dapps, DSound is not an exception. But many great artists and content creators continue to use DSound and publish content daily even in these difficult days, so my huge thanks for these guys who make DSound what it is! As the losses in value of STEEM resulted fewer publications and also in the much lower payout of the great content in our loved platform… We and the curation team decided to strengten the @dsound votes a bit to make the payouts more interesting to our great content creators. We’ll correct the voting percentage in relation with the Voting Mana of the account to always be able to make the most of our delegations and give the best rewards possible. Curation teamIt’s great to see that our curation efforts continue to produce great results! :) It is such a big deal for us, as curators in the platform, to get to the Trending or Hot pages and see only great content coming out of DSound, with such proportionate and interesting payouts. We’re really proud of the achievements of curation in these last months… DSound is this! &lt;3 DSound Discord Server (the tribe gets connected)If you’re learning about DSound now or you didn’t connect yet, please join our Discord server at: https://discord.gg/hSsBw3b There you’ll find a few channels to have everybody from our community getting together and making DSound even better. We invested a significant effort in organizing this community server and now we have rules, a set of channels where people have great chats, or support help and suggestion of features… Thanks to all participants! Thanks also to our moderators who have done a great job in keeping this a great place to hang out! Also check their work on DSound since they are content creators as well: @maelstrohmblack@juliakponsford@jamesub@archaimusic@jamesub@jeffandhisguitar@darrenclaxton The steemit.chat channels continue but are only checked from time to time now… What’s new in DSound v0.4?So now are you ready to find out what else is packed in this new release? Just grab a cup of coffee, sit down and relax… New IPFS Nodes spread globally and instant playbackWe implemented DSound’s own IPFS nodes network, that counts with nodes spread around the globe for faster access and availability: Now all content on DSound will become more accessible and all the new content will play instantly on every part of the planet! :) Also we aim to have extended the period of time that the content is available on the IPFS network. Since DSound cannot host content forever due to Intellectual Property laws and other, now any content will be available for at least two weeks. It might be longer in periods of lower volume. This will also enable the new developments already in preparation for the first beta and it will extend the way content might be hosted forever in other ways, more on that soon… ;) Post formattingFormatting in DSound description or comments was not like Steemit. Some of you like to publish rich content in your posts and had to edit your posts in Steemit after posting in DSound, so that you could get your post to look like the way you wanted. Now you can do it on DSound! The formatting is now the same on DSound and the pictures, links, youtube links, or any other content you post will be accepted and visualized as in Steemit. Unlimited editing (new in HF20)Yes, Steem HF20 enabled the edition of any of your posts, regardless of it’s date, and DSound is already allowing it too… So any of your older posts can now be edited. This is great to be abe to update your sounds in other posts after payout… Several minor bug fixes and improvementsMinor fixes here and there and improvement in flow of upload, to stay at upload page to correct anything in case of error publishing… What about the first Betarelease?Yes, the first beta is in “the making”! :) We decided to publish it in two phases due to the major changes that we implemented in it, and to enable users with all the new tested features already ready for deployment… This 0.4 includes the base changes in DSound IPFS nodes infrastructure and the handling of content in a distributed maner globally so that it gets accessible instantly. This is a much needed improvement, since the public IPFS network has been very unreliable in terms of connectivity and availability. It also serves as the basis for the new stuff that will come in the first beta later on this year! I’ll be announcing what is comming on SteemFest3, so please stay tuned to my next posts about it… Final wordsOnce again DSound is one step closer to be the platform that frees us all and allows us to do what we love: music, sound design, recording, remixing, mashups, podcasts, or whatever is your thing… :) I am really proud of this improvement in the accessibility of your content almost instantly now. Let me know what you think about it or any problems you still might face playing sounds on DSound. We are starting implementing some marketing initiatives. Started a DSound Facebook page and also got some marketing material done for SteemFest3 and other events, like some DSound stickers: We will be pushing this marketing to another level and bring DSound to the masses after the release of the first beta. Please pass the word to your friends! If they produce great content, they will produce even better in DSound! ;) TL;DRMany thanks to all DSound delegators. We and the curation team decided to strengten the @dsound votes a bit to make the payouts more interesting to our great content creators. It is such a big deal for us, as curators in the platform, to get to the Trending or Hot pages and see only great content coming out of DSound, with such proportionate and interesting payouts. Join DSound Discord server to stay up to date and access support. We implemented DSound’s own IPFS nodes network, that counts with nodes spread around the globe for faster access and availability Formatting in DSound description or comments now is like Steemit. No more missing images, links or wrongly formatted content. Yes, Steem HF20 enabled the edition of any of your posts, regardless of it’s date, and DSound is already allowing it too. Minor fixes here and there and improvements. I’ll be announcing what is comming on first beta at SteemFest3, so please stay tuned… Thanks a lot to all fellow members of DSound tribe, all steemians, developers and music addicts like me for your support and encouragement on this project! Peace! :) “Music is what feelings sound like”DSound &lt;3 Music","categories":[{"name":"development","slug":"development","permalink":"https://decentrawise.com/categories/development/"}],"tags":[{"name":"projects","slug":"projects","permalink":"https://decentrawise.com/tags/projects/"},{"name":"dsound","slug":"dsound","permalink":"https://decentrawise.com/tags/dsound/"},{"name":"music","slug":"music","permalink":"https://decentrawise.com/tags/music/"},{"name":"ipfs","slug":"ipfs","permalink":"https://decentrawise.com/tags/ipfs/"},{"name":"steem","slug":"steem","permalink":"https://decentrawise.com/tags/steem/"}]},{"title":"IMSHARE 2018 conference","slug":"imshare-2018-conf","date":"2018-06-04T23:00:00.000Z","updated":"2020-07-25T10:36:40.356Z","comments":true,"path":"talks/imshare-2018-conf/","link":"","permalink":"https://decentrawise.com/talks/imshare-2018-conf/","excerpt":"","text":"Lisbon, June 2018 Pedro Reis Colaço (aka prc) panel chat about blockchain technology and decentralization. If you were not there, then you can watch a bit here… You can check out the entire conference here: IMSHARE 2018 Enjoy! :)","categories":[{"name":"talks","slug":"talks","permalink":"https://decentrawise.com/categories/talks/"}],"tags":[{"name":"blockchain","slug":"blockchain","permalink":"https://decentrawise.com/tags/blockchain/"},{"name":"panel","slug":"panel","permalink":"https://decentrawise.com/tags/panel/"},{"name":"decentralization","slug":"decentralization","permalink":"https://decentrawise.com/tags/decentralization/"},{"name":"dapps","slug":"dapps","permalink":"https://decentrawise.com/tags/dapps/"}]},{"title":"DSound v0.3","slug":"dsound-v0-3","date":"2018-02-22T00:00:00.000Z","updated":"2020-07-22T16:18:42.871Z","comments":true,"path":"development/dsound-v0-3/","link":"","permalink":"https://decentrawise.com/development/dsound-v0-3/","excerpt":"","text":"Original post on Steem Fixes to upload, Improved validations, New IPFS gateway, Tags without prefix, easy IPFS local node and much more!You waited patiently for DSound new version and here it is the first release of 2018 packed with cool stuff! :) HTTPS://DSOUND.AUDIOWhat is DSound?DSound is a decentralized web application, developed in Javascript and React, that allows anyone to upload, listen and discover music and other sounds stored on top of the IPFS Network. It uses STEEM blockchain as a persistent database, and by posting the sounds the authors can earn rewards in STEEM cryptocurrency, when other users like their content, which can be exchanged easily to US Dollars, Euros or any other currency, similar to Steemit.com for blog posts. Check DSound Intro post for more detailsAbout @dsound delegations and curationMy huge thank you to everybody who delegated to @dsound! It makes a huge deal for the curation effort! :) As most of you certainly noticed @dsound account lost a major delegator, this augmented by the losses in value of STEEM resulted in the much lower payout of the great content in our loved platform… But we managed to strengthen the curation team, now counting with 3 curators and myself, which has resulted in more than 300 artists being rewarded properly in DSound, and this number growing everyday! :) It is such a big deal for us, as curators in the platform, to get to the Trending or Hot pages and see only great content coming out of DSound, with such proportionate and interesting payouts. We’re really proud of the achievements of curation in only 1 month! In this first month @dsoundcuration effort was able to distribute near 26K STEEM, spread to an average of more than 200 artists daily of the more than 700 daily sounds published. This is a huge deal for our 5000+ users and community! The Top Delegators @misterdelegation @soundlegion @freetousesounds @harrisonmir @humanabstract @kemal13 @justlibby @talhadogan @frew @svetoruss Please go check out these guys! Most of them are artists in DSound that want to support the curation effort… Thanks a lot guys for giving back to the platform! :) And to all the other people that didn’t delegate yet, please do so… It is very important to build a strong curation account to build up our power to keep this platform with great incentives to our artists and sound creators! It’s phrases like these that make me wake up everyday and give the best of me to this project: Hey friend! I don’t know if you know me , but I am one of your biggest fan! You changed my life few weeks ago when I started actively posting on dsound every day.It really enabled me to create more content , to dedicate myself to your platform and more importantly to believe in myself in a way that I haven’t for years , I can feed my children doing what I love, so a big thank you to you my brother from Lisbon.Hopefully one day I can meet you in real and shake your hand or buy you a beer :) DSound is this! &lt;3 DSound Discord Server (the tribe gets connected)Please join our Discord server at: https://discord.gg/hSsBw3b There you’ll find a few channels to have everybody from our growing community getting together and making DSound even better. We invested a significant effort in organizing this community server and now we have rules, a set of channels where people have great chats, or support and suggestion of features… Thanks to all participants! It was tough at the beginning but paid out in the end. Now we’ll add few moderators to help curators with normal day to day activities of the server, stay tuned for the announcements… The steemit.chat channels will continue but will be less checked from now on… What’s new in DSound v0.3?Ready to find out what else is packed in this new release? Come on, grab a cup of coffee, sit down and relax… Active discovery of public IPFS gatewaysIn order to make DSound streaming and content delivery faster, it now starts with a predefined gateway and then initiates a connection with each of the available gateways to identify the faster one, with lower latency. This means that DSound should be more responsive and it will be less frequent to see missing cover art or sound waves. Extra error checking and fixes on UploadThere were a few of you that didn’t get their tracks uploaded, and I worked with a few to figure out the problems and correct them. Thanks a lot to the folks that had the patience to send me all the information I needed to correct this and implement extra error checking on this important part of DSound. New DSound IPFS upload gatewayYes, probably you remember last Saturday, that DSound was left without upload for a period of 10 hours… Well, DSound supplier of IPFS gateway told us that he would go to shutdown the gateway in 5 days on Friday. So I was planning to use those days to deploy my own gateways exclusive to DSound instead, reducing the friction for whenever some management operation was needed. So, during my sleep from Friday to Saturday, the gateways were shutdown and I woke up with a huge list of messages in Discord with problems with upload. It was already out of service for around 5 hours and I had to configure the new server, the IPFS and all those tricks to make it work, the fastest I could! And so I did… It took around 5 hours to put up, and now we’re back to uploading craziness! :) SEO friendly URLs and Page TitleNow DSound uses #! (hashbang) instead of only # (hash) enabling web crawlers to still find their way in DSound pages, even so that the content is rendered in Browser in Javascript. All the pages have also relevant information in the title. So if you are on your feed, then your username or name will appear or if you are at a track page the track title will show up on the page title. This seams to be such a useless one, but it really makes a difference when it comes to bookmarking pages of artists you like, so you wouldn’t end up with a bunch of pages with the same title in your favorites… Now you can see what it links to! Extra Tags without the dsound- prefixThis one was highly wanted, so I got it done. Now the only tags that are processed internally by DSound are the content type and the genre/main tag. So it you want to publish a cover of a pop song (yes, now there is also a Cover song type), then you would choose Cover song for type and pop for genre, and this will result in dsound, music, dsound-cover and dsound-pop. But now if you upload a Podcast episode, then you will not get music, but podcast instead! So now remains the extra tags field where you put tags separated by , and those now are placed in your sound post without any prefix! So you can control on which tags your content will appear. It is important that you don’t remove the dsound-type and dsound-genre tags, because they are needed to be able to click a genre and those sounds get listed under that genre, for instance… This change forced that the extra tags, that appear on the bottom of the description on the entire post view page, stopped being navigable by clicking them. These tags are now only relevant for Steemit and friends, but not for DSound. The sound type and the genre are still navigable by clicking, opening a special view showing only sounds that share that sound type or genre. New convention for sound generated linksNow you may notice that your sounds link has some big number at the beginning, right after the category, and then the regular striped title without spaces. This has many advantages, one of which is to be able to publish the same title for a track as the post describing the process of your song, for instance… Another even bigger possibility is to be able to publish the same track multiple times, to be able to monetize your catalog in a better way, since good music is timeless! Please be careful with this. Don’t spam your audience. if you have a small catalog, then don’t overuse this… Also the various feeds of content now only show the last publication of a certain title. This prevents your feed from getting too stuffed if you use the previous feature. Login form with extra verificationsOne of the most common errors preventing the users from logging in was that some guys wanted to put the @ sign on the username… Another was to get the wrong key, like the public key instead of the private. So now the username field removes automatically any characters that are not valid for a username, validating as well the username conventions: at least 3 characters in each segment, that can be separated with . and only using letters, numbers or the - symbol. The key is also now tested if it fits the rules for a STEEM private key. So if the orange triangle at the right of these fields doesn’t go away when you input your data, then probably the data is wrong… Copy it again or double check it. Minor internal fixesMinor fixes here and there. Also improvement in flow from a sound to the next. And configuration now is reloaded from time to time to allow faster update of parameters and also stored locally for faster access… Improvements in switching to local IPFS node and backNow this process is almost unnoticeable. if you switch your local IPFS on, then after a bit DSound will switch to it automatically and all connections are routed through that node. Similarly, when you switch your local node off, then DSound will also switch back to public gateway mode and will run the check again to use the best available gateway with the lowest latency. House cleaner complianceYes, there are a few (dozens…) of copycats in the DSound arena… And we all want them out of out eyes, so now DSound only shows content that has positive weighted votes. This way, if the curation team or any other users flag some of the bad guys, they will not show up in any feed anymore. What’s not in DSound v0.3?Yes, there is something that I wanted so much to include, but the test phase got some major problems that need addressing, so the migration of DSound to use DSound processing and uploading nodes has to wait for the next release… This will be the major upgrade to facilitate DSound upload but it better come out vibrant and strong! So my apologies to all of you, but couldn’t keep you waiting longer for all the cool things that were already developed just because of this one. So broke this bundle into two and enhanced this version with the next topic, which is of major coolness! Local IPFS node the easy wayIt’s a pleasure to announce to all of you that wanted to install your local IPFS node for some time but struggled with the configuration, that now your problem is solved! And wasn’t me who did it… I just figured out the way to finalize the easy configuration to make it work with DSound. IPFS DESKTOPDSound forked this project but for now it is exactly as developed by the guys from IPFS team. But I think that there are some features that may see their way to mix up in this project, because a local node may as well be a processing node, right? So the idea is to have you playing around with this project. On my Mac it setup really easy. Just needed to change a small bit in the configuration file… Of course this will be the first thing to change for DSound fork of this project, but for now I will tell you how to do it the hard way… ;) InstallationPlease click the link above and you’ll see on GitHub page below the file browser an “Install” heading, below it you see: “Go to the latest release …” click there, or here because it will link to the same page… There you’ll find installation packages for Linux (rpm and deb), Mac OSX (dmg) and Windows (exe), so feel free to download the right one for your platform and install it. When you run it for the first time you’ll see the screen below, and here you better click the “Advanced Options” button to check out where it will install the IPFS data directory in your platform. In Mac and Linux it will be in “.ipfs” directory under your home directory by default, in Windows I don’t know because I don’t use it… Then note it down and continue the installation. It should be quite fast. IMPORTANT NOTE: For those who already installed IPFS before in your computer, please delete the installation data directory, and then perform this installation. Most probably IPFS Desktop will not even ask you to install in the first run. Next just quit the application and go to that directory you noted down. There you should find a file named “config”. Open it with your favorite text editor. In this file you’ll read somewhere:1234567...&quot;API&quot;: &#123; &quot;HTTPHeaders&quot;: null&#125;,... and you need to change it so that it looks like this:12345678910111213141516171819...&quot;API&quot;: &#123; &quot;HTTPHeaders&quot;: &#123; &quot;Access-Control-Allow-Credentials&quot;: [ &quot;true&quot; ], &quot;Access-Control-Allow-Methods&quot;: [ &quot;PUT&quot;, &quot;GET&quot;, &quot;POST&quot; ], &quot;Access-Control-Allow-Origin&quot;: [ &quot;*&quot; ] &#125;&#125;,... Then start up the IPFS Desktop app again and you should be good to go! This easy! :) Your node will be configured and running and you’ll see in DSound that the node is online in the IPFS Settings. Please note that this is early stage software that might have some bugs and be in active development so don’t rely too much on it, but besides that it worked with me so far and it is a simpler way of starting and stopping the IPFS node when we need it. If you use it to upload, then please give it some time after the upload to sync up with the network, so that the contents of your sound get spread through caches of other nodes. One good way to make sure is to open the content in another computer running DSound without IPFS, or just wait for people to start watching your content and commenting it, then you know that your content already have a live of its own! :) DSound will try to pin your own files in your IPFS node, so that if the network “forgets” your content, then you can just connect the IPFS node and access the files again and they will spread again through the network… What’s next?Well, need to finish the processing and uploading nodes, solving those issues that prevented it to be done by now. Then will continue down the path of the roadmap by priority… Another thing that I want to get started with is to put out some marketing effort to bring more people to the platform. When we have the upload resolved and more nodes to make the network scalable infinitely, then the only thing that is missing is more people! And now is the time to do it… :) Final wordsOnce again DSound one step closer to be the platform that frees us all and allows us to do what we love: music, sound design, recording, remixing, mashups, podcasts, or whatever is your thing… :) I am positive about this curation incentive, as the needed fuel to bring DSound to the masses. Please pass the word to your friends! If they produce great content, they will produce even better in this platform… Together we’ll see DSound get to the next level, tribe! :) TL;DRDSound curation initiative has done a huge impact this first month. More than 300 artist voted and 26K STEEM distributed. An average 200+ daily votes over 700+ daily uploads, from 5000+ users. DSound v0.3 brings: Active discovery of public IPFS gateways, Extra error checking and fixes on Upload, New DSound IPFS upload gateway, SEO friendly URLs and Page Title, Extra Tags without the dsound- prefix, New convention for sound generated links, Login form with extra verifications, Minor internal fixes, Improvements in switching to local IPFS node and back, House cleaner compliance. And also easy instructions on how to install IPFS Desktop from IPFS team to manage your local IPFS node easily! Thanks a lot to all fellow members of DSound tribe, all steemians, developers and music addicts like me for your support and encouragement on this project! Peace! :) “Music is what feelings sound like”DSound &lt;3 Music","categories":[{"name":"development","slug":"development","permalink":"https://decentrawise.com/categories/development/"}],"tags":[{"name":"projects","slug":"projects","permalink":"https://decentrawise.com/tags/projects/"},{"name":"dsound","slug":"dsound","permalink":"https://decentrawise.com/tags/dsound/"},{"name":"music","slug":"music","permalink":"https://decentrawise.com/tags/music/"},{"name":"ipfs","slug":"ipfs","permalink":"https://decentrawise.com/tags/ipfs/"},{"name":"steem","slug":"steem","permalink":"https://decentrawise.com/tags/steem/"}]},{"title":"DSound presentation at SteemFest 2","slug":"dsound-steemfest2","date":"2017-12-21T00:00:00.000Z","updated":"2020-07-24T15:01:42.425Z","comments":true,"path":"talks/dsound-steemfest2/","link":"","permalink":"https://decentrawise.com/talks/dsound-steemfest2/","excerpt":"","text":"Original post on DTube Lisbon, November 2017 Creator of DSound (@prc) presentation. If you were not at SteemFest 2, then you can watch it here… You can check out DSound at: dsound.audio And… Much more news to come soon! Stay tuned DSound Tribe! Enjoy! :)","categories":[{"name":"talks","slug":"talks","permalink":"https://decentrawise.com/categories/talks/"}],"tags":[{"name":"projects","slug":"projects","permalink":"https://decentrawise.com/tags/projects/"},{"name":"dsound","slug":"dsound","permalink":"https://decentrawise.com/tags/dsound/"},{"name":"music","slug":"music","permalink":"https://decentrawise.com/tags/music/"},{"name":"ipfs","slug":"ipfs","permalink":"https://decentrawise.com/tags/ipfs/"},{"name":"steem","slug":"steem","permalink":"https://decentrawise.com/tags/steem/"}]},{"title":"Steem @prc witness proposal","slug":"steem-prc-witness-proposal","date":"2017-11-28T00:00:00.000Z","updated":"2020-07-22T11:04:15.589Z","comments":true,"path":"infrastructure/steem-prc-witness-proposal/","link":"","permalink":"https://decentrawise.com/infrastructure/steem-prc-witness-proposal/","excerpt":"","text":"Original post on Steem After creating DSound and attending SteemFest 2, I want more! I’ve met a lot of you online already, and some of you at SteemFest 2 in Lisbon, which was really amazing by the way and is not because I am portuguese at all! I came to Steem about 4 months ago and I already feel like home here. I found out so many interesting people and I stand by the community-driven content rewarding on blockchain idea so much, that in this little time I already contributed to the ecosystem by creating DSound and continue maintaining it. I want my journey on Steem and Steemit to be worth it and use this opportunity to leave my mark on this wonderful community by bringing more innovative and fun projects for everybody to enjoy, while helping Steem to grow and be more valuable for all of us. ActivityI comment, curate, and actually read/view/watch/listen to great content our fellows post everyday. I also participate and help users on steemit.chat. I post. And I want to post more. And being a musician and music producer I want to use my DSound to publish my music, as well as projects like DLive to share my DJ sets live from my studio with all of you. I want to create more dapps for steem, and I want to make DSound one of the success cases of this ecosystem, among other great projects, by going public with it and use SMT’s to bring more value to our community as well. Why offer myself to be a Witness?I have around 30 years of experience as a software developer, from C/C++ all the way to JavaScript, I’ve used all the languages, and most important I have more than 20 years of server management and my own datacenter in Portugal. With these characteristics added by the true enthusiasm I feel by Steem community, I couldn’t resist to offer more to all of you and get more involved in this awesome experience! Being a witness is not only technical. It mostly is a community leadership and support activity which I believe I can perform by helping Steem to grow to Portuguese speaking communities and bring more and more people to the ecosystem, by spreading the word and by developing other niche communities over Steem, like music lovers and many more. I want to make Steem huge and bring all of us together around it! This is the responsibility I am assuming before the Steem community… Technical InfrastructureI’ve put together a set of dedicated server boxes for this endeavour that, after some investigation and questions asked in the steem.chat witness channel, I think will prove well and deliver stable performance to the Steem blockchain. All boxes are behind firewalls, IDS and power redundancy systems. The server characteristics are subject to upgrade or revision as needed. Witness node Dedicated Server CPU Intel i5 4x core 2.5 GHz RAM 32GB RAM DDR4 Disks 128GB SSD Connection Gigabit over optical fiber backbone Power Redundant + UPS Location EU - Portugal Backup node Dedicated Server CPU Intel i5 4x core 2.5 GHz RAM 32GB RAM DDR4 Disks 128GB SSD Connection Gigabit over optical fiber backbone Power Redundant + UPS Location EU - Portugal Seed node Dedicated Server host:port seed.steem.prcolaco.com:2001 CPU Intel i5 4x core 2.9 GHz RAM 32GB RAM DDR3 Disks 128GB SSD Connection Gigabit over optical fiber backbone Power Redundant + UPS Location EU - Portugal Why I want your approval vote?I want your vote, XS, S, M, L, or XL, if you trust me and approve what I do in the Steem ecosystem. My involvement with the community will continue to grow and many other projects will join after DSound, as I am constantly with new ideas. The stake of Steem I already hold, as well as what will come from witnessing, will be invested in the ecosystem, and the remaining will be vested as I already do, as I never powered down. I want to witness Steem growth and success, so count on me to help make it happen! :) You can make your approval vote for me as a Steem witness here:https://steemit.com/~witnesses Or via cli_wallet with the command:&gt;&gt;&gt; vote_for_witness youraccount prc true true Thanks to all the fellow Steemians who have been supportive of DSound and my contributions to the community in general! Without you I wouldn’t be here assuming this responsibility. Big thanks to all of you!","categories":[{"name":"infrastructure","slug":"infrastructure","permalink":"https://decentrawise.com/categories/infrastructure/"}],"tags":[{"name":"projects","slug":"projects","permalink":"https://decentrawise.com/tags/projects/"},{"name":"steem","slug":"steem","permalink":"https://decentrawise.com/tags/steem/"},{"name":"witness","slug":"witness","permalink":"https://decentrawise.com/tags/witness/"},{"name":"bp","slug":"bp","permalink":"https://decentrawise.com/tags/bp/"},{"name":"dpos","slug":"dpos","permalink":"https://decentrawise.com/tags/dpos/"}]},{"title":"DSound v0.2","slug":"dsound-v0-2","date":"2017-10-10T23:00:00.000Z","updated":"2020-07-22T11:03:27.889Z","comments":true,"path":"development/dsound-v0-2/","link":"","permalink":"https://decentrawise.com/development/dsound-v0-2/","excerpt":"","text":"Original post on Steem Streaming, Sound Edit, Performance and Layout Improvements. Just one month and such Big News!First of all thanks to all of you who joined this project and made it a big success on this 1st Alpha version! :) I have to thank you all even more because things didn’t always worked out great. We had a lot of problems related to the performance of the platform or other problems with IPFS sound uploads, but you were always there trying to upload your sounds and giving feedback so that I could take the right steps to solve the issues. Big Thank you guys! Now let’s take a pick of what is there to come on this release… DSound version 0.2 This version is FAST! Probably the best news you all can get… :) Unfortunately most of the problems with performance were due to IPNS (Inter-Planetary Name System) that allows publishing of web applications to IPFS using names instead of hashes. So I opted to publish to IPFS and to regular centralized web server as well, since the web server will be the most used, we will have significant better performance for normal use, but keep redundancy of publishing to IPFS and IPNS on the side as a backup access. Version 0.2 web addresses The various links to the same app, you probably want to use the first one as it is easier. The others are just backups, just in case… ;) Web: https://dsound.audio/ IPFS: https://ipfs.io/ipfs/Qm… IPNS: https://ipfs.io/ipns/dsound.audio/ Now let’s go ahead and check the new features and fixes… Streaming instead of Preloading This one was very important! Many of you guys published podcasts, djsets, recordings, mixtapes, etc. And the way DSound engine was developed it would preload the entire sound before starting the playback, so for big files with 1 up to 4 hours it was a nightmare to wait many minutes before the playback was started… The behaviour of the first version was due to many restrictions in the way a web application can manipulate audio in the browser, and I had to write almost an entire new sound engine just for playback, maintaining the other for sound processing and analysis when uploading new sounds… But what is important is that you wont have to wait like that anymore!!! :) Try it yourself and let me know in the comments your feedback… Sound edit page Now you can edit your sounds! :) You can change the cover, the sound file, add more things to the description, change tags or genre, modify download or buy links, etc… Of course, as any frontend to STEEM blockchain all of that can be done only during the initial 7 days, because after the sound payout time it will be sealed in archive forever. But I think that this feature was really high on the list of needed tools for DSound Platform, so hope you all like it! To find the edit button you need to open your sound page, by clicking on the sound title, and then you can see the edit button with a pencil where usually there is a repost one, only on sounds that belong to your user… In the meantime, if you feel like listening to some deep house, you can check out my remix that was showing in the picture above in this link: https://dsound.audio/#/@kolatz/oliver-heldens--shaun-frank-ft-delaney-jane-shades-of-grey-kolatz-remix It’s from last year, but I really like it… And yes, @kolatz is my music alter ego… :) Display of sound value after payout This fix was really my bad! I completely forgot that the pending payout eventually would stop being pending… ahahah :D But now your sounds will show the payout that they deserved even after the payout time. Much better! BTW, did you already listened to some of the tracks of @soundlegion? Great songs! Go ahead and listen to some here: https://dsound.audio/#/@soundlegion HTML and Markdown in sound description and comments This one was not a very big deal, but it is nice to have. My major worry was security and had to make sure that only some html tags would pass and that markdown would be supported as well. From the security point of view it is taken care, so I decided to give it a try… I know it is not perfect yet, there are some situations where the text makes the panel enlarge, pushing stuff off screen, but I’ll fix those issues along the way as people will post more sounds with more html and markdown in their texts. :) Sound duration displayed in the players See those black pills right after the title of the sound? That’s where you can read the duration of that particular sound. :) This one I noticed the need. I always have limited time to listed to podcasts and other shows like @layl , @anarchast and others, so when I finally have some spare time, I need to know if that particular show fits gap on my schedule. And on DSound I couldn’t… Not anymore! Now all of us can see if it is a 1 hour show or 5 minute song right in the feed… Many other fixes and improvements I don’t want to bore you with these minor things… Many places where the flow wasn’t completely right. Limits of texts, tag sizes and count, internal things and so on… All those minors that we step on when going for major developments and we fix right away. IPFS uploads and publishing vs centralized web server (this may be too techy… maybe it’s time to jump to next topic?) Yes, I opted out of the IPNS deployment of DSound application. I tried really hard to find solutions for that problem. I really like IPFS technology, but there are certain things that simply don’t work yet! IPNS and web publishing performance are not production ready yet. I’ll continue to publish both on IPNS and on my web server, being the web server the one behind the domain http://dsound.audio to make the application more responsive when loading to the browser. Also other libraries that I was loading from IPFS, now I have them static on the web server and load time went down significantly. So, when the load times come more close between web server and IPFS/IPNS maybe we give it another try? ;) In the meantime we keep IPFS for storage and have the web application published as a backup, if something goes wrong with the main domain. Another big problem that we had lately was some downtime on IPFS uploads. Configuring IPFS nodes to be used by the public is a very difficult task indeed, so I have to thank @nannal from IPFS Store for his efforts in keeping everything up and running on his side! But since the beginning that I envisioned DSound using local IPFS on each user machine. That would be fast like a rocket to upload, and most important of all, the user would have the power in his hand to decide which and for how long the storage of his files would make sense. This will be my next major thing to solve… :) What’s next? So, the next period I’ll be concentrated in these major topics for DSound: Local IPFS node helper application: so that all of us can have our own IPFS node easy to install and maintain Sustainable business model for DSound: I want DSound to be free for everybody, but it has to generate enough capital to be maintainable like this. This model of rewarding is probably not the best approach, so I need to figure out a way to make it more profitable, without passing those costs to my users, which is kind of demanding, since I never looked at DSound from the business point of view… Maybe the SMT’s from Steem team, that @ned presented few weeks ago are one of the ways? Open to your ideas in the comments below! :) Possible integrations o DSound with other platforms: to achieve more markets and use cases and grow user base Continue improvements and project roadmap Final words Thanks a lot to everyone that joined this project, uploaded sounds, listens to sounds on DSound and everyone that upvoted, resteemed and passed the word about DSound. I strongly believe that this can be a game changer for indie musicians and producers. I want to make it a reality! :) For all of you that already tried out, you’ll verify that DSound is improving and so I would ask you all to talk about it to all your friends that may be interested in sound and music. I know that together we’ll make this grow and give hundreds or thousands another way of monetizing their passion… While bringing more content creation to our beloved platform Steemit! My special thanks to these great uploaders for sharing their sounds on DSound, please check them out: @soundlegion @webresultat @fivestargroup @maxjoy @maneki-neko @ashaman @dreamrafa @humanabstract @layl @goodbyematrix And that’s it for now. We’ll keep on this journey trying to change the music world for the better… :) “Music is what feelings sound like”DSound &lt;3 Music","categories":[{"name":"development","slug":"development","permalink":"https://decentrawise.com/categories/development/"}],"tags":[{"name":"projects","slug":"projects","permalink":"https://decentrawise.com/tags/projects/"},{"name":"dsound","slug":"dsound","permalink":"https://decentrawise.com/tags/dsound/"},{"name":"music","slug":"music","permalink":"https://decentrawise.com/tags/music/"},{"name":"ipfs","slug":"ipfs","permalink":"https://decentrawise.com/tags/ipfs/"},{"name":"steem","slug":"steem","permalink":"https://decentrawise.com/tags/steem/"}]},{"title":"DSound, the launch","slug":"dsound-the-launch","date":"2017-09-14T23:00:00.000Z","updated":"2020-07-22T11:04:02.667Z","comments":true,"path":"development/dsound-the-launch/","link":"","permalink":"https://decentrawise.com/development/dsound-the-launch/","excerpt":"","text":"Original post on Steem What’s new now that the 1st alpha is closed and the FULL decentralization of itFirst of all, I wanted to thank all of you that jumped right in and uploaded content to DSound! It was amazing to see great sounds being added on such a cadence! :) There are really a lot of creative people in STEEM community. My thanks to all of you who believed in this project and embraced it right away! The LaunchIn every first launch of a new project there are bugs, crashes and complications that make our live as developers really crazy. With DSound it was really smooth, I have to admit! It had a few bugs, of course, we cannot predict everything at our test bed, but I think it went really well and, on those small bugs we found along the way, I had all the people on my side trying to help. This is so fantastic! Yesterday I considered this first version 0.1.1 closed and this is the official first alpha version of the project! With all your help I could fix all the major problems in DSound and have a minimum viable product usable by all of us. Thanks so much to all of you who helped me and put your time trying DSound! :) What changed behind the scenesDSound got a server of it’s own. Initially it was published in my development server, but now it was moved to its own space in the web. But that is not all! DSound new home is only a bypass to an IPFS node that caches versions of DSound project and shares them on the IPFS network. This makes it possible to access DSound in various ways, from many IPFS nodes around the globe. So DSound now is fully decentralised and impossible to stop! :) Ways to access DSoundThe regular way will always be: https://dsound.audio/ But you can also access it through IPNS (Inter Planetary Naming Service) which glues perfectly with IPFS like this: https://ipfs.io/ipns/dsound.audio/ or https://gateway.ipfs.io/ipns/dsound.audio/ This means that the domain dsound.audio exports a link to an IPFS peer that hosts the latest version of DSound, and through IPNS it is possible to reach to that peer, by appending /ipns/dsound.audio/, to any gateway in the world! Isn’t it awesome? But both these ways require the use of a domain name, and if there is any kind of pressure from installed corporations to stop DSound, the domain name will be the easiest way to try to stop it. What can we do about it? Full decentralized accessThere are projects already on their way that try to solve this problem, like Namecoin, but right now we will need to go the IPFS way… So to access DSound from the nearest node that caches the latest version of the application you can use: https://ipfs.io/ipns/QmbjdbW7D3Zc6AhiF8yQ4P6qpPmtiEZiJ8NS8Z7CVFgcFX/ or just append /ipns/QmbjdbW7D3Zc6AhiF8yQ4P6qpPmtiEZiJ8NS8Z7CVFgcFX/ to your favourite IPFS gateway. This link will allways point to the latest version of DSound. Access specific versions of DSound - Full power of decentralizationEach version that is closed is published recursively to IPFS, as a directory in a web server. So each version will have its own IPFS hash and will be accessible as long as there is still a node in IPFS network that caches or pins it. Wow! :) This means that we will be able to track versions and even check differences along the evolution of DSound project. So below there is a list of DSound versions up to now and their respective IPFS hashes and links. I will make another post to hold this information permanently on STEEM so that we keep a record of all the versions and as a reference if something happens with the domain or the hosting of DSound. DSound Versions on IPFS Version IPFS Hash link v0.1.0 /ipfs/QmSMruoCXkLJDvcrP8127YUkkjndkpw384SP2r7e98UayK v0.1.1 /ipfs/Qmf6b4SyFi1wYV2zQBVtRL9woAvGYFin2AQiRMe5ff4Hx7 To get any version just append the IPFS hash to https://ipfs.io or https://gateway.ipfs.io or your favourite IPFS gateway. NOTE: Version v0.1.0 is not showing anything, because of a problem with relative links, but it is there forever on IPFS network… This is just the beginning… DSound rocks! :)","categories":[{"name":"development","slug":"development","permalink":"https://decentrawise.com/categories/development/"}],"tags":[{"name":"projects","slug":"projects","permalink":"https://decentrawise.com/tags/projects/"},{"name":"dsound","slug":"dsound","permalink":"https://decentrawise.com/tags/dsound/"},{"name":"music","slug":"music","permalink":"https://decentrawise.com/tags/music/"},{"name":"ipfs","slug":"ipfs","permalink":"https://decentrawise.com/tags/ipfs/"},{"name":"steem","slug":"steem","permalink":"https://decentrawise.com/tags/steem/"}]},{"title":"Introducing DSound","slug":"introducing-dsound","date":"2017-09-07T23:00:00.000Z","updated":"2020-07-22T11:03:49.939Z","comments":true,"path":"development/introducing-dsound/","link":"","permalink":"https://decentrawise.com/development/introducing-dsound/","excerpt":"","text":"Original post on Steem A decentralized sound platform using STEEM and IPFSAround tow months ago I joined STEEM community, and since I started to know more about it I understood that this was the place I wanted to be. Then later I saw DTube being announced and my head was going around in waves about this mix of technologies that made it possible… I met @heimindanger and chatted about his project and absorbed some of the details and ideology, of which I share the same vision. And it got my engine running, so I dived in and started implementing my own vision of what I wanted as a platform for publishing music and sounds in general. And now I am proud to introduce you all to… DSOUND.AUDIOWhat is DSound?DSound is a web application that I developed in Javascript, that allows us to upload, listen and discover music and other sounds stored on top of the IPFS Network. It uses STEEM blockchain as a decentralized database, which allows authors to earn rewards in STEEM Dollars cryptocurrency, which can be exchanged directly to US Dollars or any other currency, when other users like or repost our content, in the same way as Steemit.com for blog posts. I decided to follow the same approach as @heimindanger and develop first and talk after. And I worked almost non-stop until I have this first alpha version to share with you! It is only a minimum viable product of what can become the platform of reference for musicians to publish their songs, promos and recordings and be rewarded for their work immediately, without any publishing and/or distribution involved. As a musician and DJ as well I deeply understand the music industry and my only aim is to create a platform where I would love to publish my own works, to receive the feedback from the community and earn few bucks with it… And if you also are in the industry, you know how difficult it is to make any money with our creations in the music business these days! There are some platforms that allow it, if you are signed with a big label, like SoundCloud, YouTube, Apple Music or Spotify, but if you are an indie like myself, you get lucky if you can publish any of your own creations on these channels without being taken down! I had my own creations (without any sampled materials) being taken down for copyright infringement, just because they can. Even worse for other kinds of creations, which constitute fair use of the copyrighted materials, like remixes, mashups or DJ sets. If you want to share any of these with your fans, nowadays you can’t! If you upload these works to YouTube or SoundCloud in a matter of seconds they are taken down for copyright infringement. This is not acceptable. These are derivative works of the original ones, which serve to promote the authors or give them a different use, like a remix makes people dance to an undanceable song, or a DJ set which mixes and blends together several tracks to produce a completely different sound vibe. These creations deserve to be published and their authors deserve to earn their bucks if people like it! So, the copyright law is broken and needs fixing. But in these last cases, besides being fair use, the industry is abusing the small creators with their super-powers making it impossible for them to survive without working other jobs to put food to their tables, instead of focusing on creating and spreading love! But this is about to change with DSound!!! :) How to use DSound Logging inCreate a STEEM account on Steemit.com, if you don’t have one already, then enter your STEEM username: Enter your Private Posting Key, you can find it here: Multi-user login If you are an artist as well, it is common to have your artistic names, which leads to having multiple accounts on the social networks and usually makes it a real pain to always being logging-out and logging-in to use your different pseudonyms. Youtube and Facebook have this feature allowing you to switch between them easily. So, I followed the same idea as @heimindanger and implemented it on DSound as well, letting users log in with as many accounts as they want, and switch between them. IPFS Settings DSound manages all IPFS settings for you right now. Maybe in the future it will have a way to fine tune them, but for now it is all taken care. It shows if you are running a local IPFS node or not, and if you do DSound will happily use it, otherwise it will connect to other IPFS nodes on the network to upload and store your content. Uploading First, you need to be logged-in to be able to access the upload page.Then just simply upload the audio file, the cover art (not required but much appreciated by your listeners, like a part of your sound that fills the eyes), and finally fill the texts for the blockchain and publish! If all goes well, you should be taken to the new sounds feed where your sound should be sitting, waiting to be played by your fans. The process can take between 0 and 30 seconds, depending on the IPFS network status and your connection speed. This is where having a local IPFS node installed helps a lot, and if you upload regularly you should definitely think about it. I will be developing a desktop app, together with @heimindanger from DTube, to allow non tech users to install the IPFS and configure it correctly for use with both DTube and DSound, but until then you can always try it out with the instructions found on the IPFS website (not very easy for non tech savvy people…) Browsing and Discovering SoundsHere I tried to replicate the way Steemit.com works, with the exception of the home page where you view the feed of sounds that had any recent interactions, like comments or upvotes. Then you have the regular Trending, Hot and New main sections. They work the same as in Steemit. If you click on a sound (title or cover) you will get to the sound page: If you click on a ‘#tag’ on any page, you can discover sounds only on that category, even if you select the new, hot or trending sections you will be seeing that category on the chosen section. By clicking on the logo to go to your feed or exiting the browsing to any other page you will exit the category mode. When browsing in category mode you’ll see the category ‘#tag’ at the top: Anywhere on the application you can click on an ‘@user’ to view that user’s publications alone at the user page: Yes, you can see the new profile cover picture of Steemit at the cover of DSound user profile page! :) And anywhere you see a track player with the play button and a waveform of the sound, you can play that sound and navigate in it by clicking on the waveform as you do on SoundCloud. Also, throughout the app you see the player at the lower part of your screen and that player plays music even when you navigate through the application, knowing your last feed selection of songs and playing them in sequence or shuffle them for you! This is all based on STEEM blockchain, so naturally you can like sounds by clicking on the ‘heart’ icon, republish them on the ‘repost’ icon, download the sounds on the Download button (if enabled by the author) or otherwise the author may activate a Buy button with a link directly to that sound on any music store of his choice or even his website. By disabling the download link, the author is only not giving his permission for you to download the sound directly on DSound, but through IPFS network, everything in it is naturally available to download, so don’t think your content will not be downloadable if you disable the download button when uploading! As with SoundCloud, YouTube, Spotify or any other content sharing, if you can stream it you can download it, one way or the other… The following parts of this article are mostly technical and maybe not so interesting to some people not on the tech side, but if you are curious about the internals of DSound you can continue, as I’ll try to explain how it works with simple common words, when possible… ;) How DSound worksSTEEM Blockchain as database What makes DSound so special is its decentralized nature. Using a blockchain for it was my idea for ages. STEEM has many advantages over other blockchains. It is fast (3 sec blocks). It is free, anyone can use it without having to deposit some form of currency, and transactions have no fees. Other projects are already there that implement some kind of Music Currency, that you can use to buy access to music content, like Musicoin or Resonate. I wanted to build something that works the other way around, and to reward music creation by the community, in the same way that STEEM blockchain already implements its reward-earning mechanism for blog posts. Similar to DTube, any sound uploaded on DSound becomes a STEEM content, that can earn rewards for 7 days. DSound doesn’t use either the title or the body of the STEEM post to store information, therefore if you don’t want your sound to appear in your Steemit feed, you can edit or delete it. The sound will stay intact on DSound while it will be invisible on other applications like steemit.com or busy.org. I believe the current behavior to be correct and that it contributes to platform growth and users rewards increase. IPFS as static file storage This was actually the final ingredient that I got from DTube and @heimindanger… When I saw the initial DTube post I was thrilled! I had found the missing piece that I needed to finally build DSound! In his article @heimindanger describes perfectly the IPFS protocol at a high level, so I include the following paragraph from his post that generically describes it all: “IPFS is a protocol that enables decentralized file storage. The principle behind it is called Distributed Hash Tables (DHT). The same principle also powers the BitTorrent network. Just like how cryptocurrency uses asymmetric cryptography, DHT networks will hash contents in order to be able to identify a file. The hash becomes the identifier of a file, and it’s as easy as re-hashing a file and making sure the hashes match to ensure the file that was sent to us is the original.” IPFS is young, open-source, and actively being developed, with many bright minds working on the project. I believe it has a great future ahead. Using it as the main means of storage for this project was incredibly easy, even with such a young project. IPFS Storage CostHere I faced the same difficulties as DTube. There is no magic, someone needs to seed the files, and the browser is unable to permanently store large files (local storage is limited to 50MB on most browsers), so in-browser seeding is not a solution. My first idea was to require users to run their IPFS node locally in their computer, but it became clear after a few chats and brainstormings that this wouldn’t be a solution, as IPFS is still not easy to set up for a regular user, and there are a few open source apps that attempt to provide an easier path but they are too unstable even for testing purposes… I still believe this solution to be the right one for DSound, and possibly DTube as well, but I would clearly need to build a desktop application, for Windows, OSX and Linux, to ease this setup process to the point that even my grandma would do it, so that it will be a plausible solution to the storage part of the equation. But for now I needed a way for DSound to store the contents without a local IPFS node, a requirement that will not disappear and possibly will even grow as many users don’t like installing stuff, so I asked @heimindanger of DTube about it and got to chat with the owner of IPFS Store as well, which as been a great help even in trying out DSound and bug reporting. Great guy this @nannal (steem, twitter/etc), recommended! So I ended up with the same approach as DTube, created a @dsound account and this account will be used to collect 25% of the DSound author rewards. The rates of storage are the same, but historically in STEEM video content more than doubles the rewards on music content, so I think it is fair to go with the same percentage of the author rewards, basically due to the probability that the storage / reward ratio will be probably identical. Also part of these rewards will be used to finance the continuation of the project development, if the community finds it useful, and hire a project team if it all turns out really well. Should one day the project is done and it may survive on it’s own without much effort in development and maintenance, and a large user base have their own IPFS nodes, then my contribution to the project will not be needed so often and the project will be open sourced and the reward sharing percentage removed. Design and User ExperienceHere I decided to have a simpler but equally intuitive approach, inspired by the leading sound sharing platform SoundCloud, as the potential users are already used to it. I tried to have the design as clean as possible without distractions, but still showing what users care about and facilitate the usages that they require, like waveform navigation, commenting, republish and like content. Another main requirement was to make it easy to discover new music, as that is really important for DJs like myself, thus the browsing by tags and merging with top sections. I think I did fine on this for this first version, but still a lot to improve and new features to implement, as described in the roadmap below. Browser stored dataDSound will use your browser local storage to store your user accounts and posting keys encrypted, so that you don’t have to login every time. If you clean your browser stored data, you will have to login again in all accounts on DSound. Why can’t I log in with my master password or active key?Because you simply shouldn’t do it! Steemit.com allows it solely because they also have a wallet in the application, but you shouldn’t login on Steemit.com with your password anyway, it is a bad practice. I think the worse thing a developer can deal with is sentiment of guilt cause by their users losing their money and accounts due to a security breach in his application or on a specific browser. Instead, it is much safer to only allow the use of the private posting key and limit the risks. If you want to manage your STEEM rewards, I invite you to use Vessel. And start using only the posting key on any online platform such as Steemit.com, Busy.org, etc. Sound processing on uploadDSound already do some needed sound processing on upload. This is required to be able to display the waveforms of sounds before downloading them from IPFS network. A typical good quality song file is around 10MB, so it could take as much as 30 seconds to display a sound waveform on the screen. This multiplied by 6 sounds per page would be insane due to the time it took and the bandwidth required for just displaying files that the user didn’t necessarily want to play anyway. So on DSound I implemented it the other way around: at upload time DSound reads the contents of the sound file and processes it to generate the peak values for that file that will feed the waveform display. That peak data is then uploaded to the IPFS network, alongside with the original media, thus generating 2 files uploaded per sound published, not counting the cover art image. Then downloading a 15KB peaks file is almost instantaneous, and it will only download the media file if the user wants to play it! Cool isn’t it? Integration with other platformsAny other STEEM based platform can easily integrate sounds posted on DSound. The sound and cover IPFS hashes are stored inside the json_metadata of the post. Then it is as easy as doing:1&lt;video src=”https://ipfs.io/ipfs/soundhash” poster=”https://ipfs.io/ipfs/coverhash” controls&gt;&lt;/video&gt; or1&lt;audio src=”https://ipfs.io/ipfs/soundhash”&gt;&lt;/audio&gt; Known Issues Problematic behavior in iPad Some weird event race on drag over the sound upload area Found another? Please get to me on steemit.chat Roadmap (missing features) Search (in a decentralized way - not possible now) Playlist sharing and playback Playback goodies like cross-fade Mobile app for iOS and Android Custom Player for Social Networks integration Sharing to Facebook, Twitter, and others I believe the current state of the DSound is viable, even without these missing features. I will add them, slowly. Please let me know what you want to be implemented first, or other feature suggestions in the comments… App DependenciesDSound is built with React, and uses many open-source packages from NPM. DSound wouldn’t exist without them, so they deserve some credits: js-ipfs-api - Communication with the IPFS Network SteemJS - Communicating with the STEEM Blockchain autolinker - Adding links to descriptions / comments moment - Displaying times XSS - For displaying untrusted texts and preventing XSS attacks Last wordsThe same way as @heimindanger, I am a true believer that decentralization is the future and I am trying to contribute with my share to change the world. But I know that I will have a hard time here because competing with SoundCloud will not be an easy task! DSound will be decentralized the most I can, in order to get the project out of my direct control leaving only the domain as single centralized dependency for now. Also I expect to have even more pressure from the Labels due to copyright infringement, although you didn’t read a single word from me about building DSound to circumvent or facilitate sharing of copyrighted materials illegally, as I am a musician and DJ myself and I comply with all copyright laws all the time. On the other hand, I defend that the copyright laws are being misinterpreted by labels in their favor, allowing them to use their huge economic power to impoverishing 99% of the music creators, while monopolizing the 1% that they enslave with their 100 pages contracts and 360º deals and making huge profits out of those, in times that publishing is MP3 and distribution is Internet. So, labels are now marketing companies that sell their brands, and fight all others that attempt to bring something new to the world, that is not own by them! I will never encourage the use of music without any kind of contribution to the actual guy that put in the time and creativity to turn that into a music that we enjoy! Authors also need to buy stuff on supermarkets, they don’t survive out of nothing and without them the world would be so less interesting… What I don’t agree with is the abuse of the same laws that had in their true heart the need to defend the rights of those who make our world more entertaining, to enforce the enrichment of few and prevent us from hearing all the music created that we possibly can and enjoy it all!For example, do you that the music of this century is based on electronic instruments and sampling? All music in the tops contains some kind of sample or sampled instrument! And the labels go after remixers and take down their content while they publish and make fortunes with other sampled songs as well?! Also go after the small DJs and take down their work, because they are using music that they bought legally to make their sets, prohibiting them of having their work shared and get noticed by what they do best… How the heck should a DJ make a set to share without any copyrighted material in it? Does this sound sane at all?! So DSound is NOT about facilitating the sharing of copyrighted material, but it is all about freeing the authors of the pressures of the major labels and giving them a tool that enables them to make decent living out of their creations without having to be signed to a label and enslaved their lives. If I can help to make this happen, I will be the happiest man on this planet, because… “Music is what feelings sound like” Cheers, PRC","categories":[{"name":"development","slug":"development","permalink":"https://decentrawise.com/categories/development/"}],"tags":[{"name":"projects","slug":"projects","permalink":"https://decentrawise.com/tags/projects/"},{"name":"dsound","slug":"dsound","permalink":"https://decentrawise.com/tags/dsound/"},{"name":"music","slug":"music","permalink":"https://decentrawise.com/tags/music/"},{"name":"ipfs","slug":"ipfs","permalink":"https://decentrawise.com/tags/ipfs/"},{"name":"steem","slug":"steem","permalink":"https://decentrawise.com/tags/steem/"}]},{"title":"DecentraWise presentation","slug":"decentrawise-presentation","date":"2016-11-16T00:00:00.000Z","updated":"2020-07-22T00:01:24.319Z","comments":true,"path":"team/decentrawise-presentation/","link":"","permalink":"https://decentrawise.com/team/decentrawise-presentation/","excerpt":"","text":"It’s November and blockchain technology has long evolved since 2009 Halloween and the release of the Bitcoin whitepaper. For quite some time I have been thinking about building something related to this technology. I think it is starting to boil now… So, let’s get our hands dirty and start building! :) I’ll start by finding some key areas that I feel the need for change, and also get a feel of the state-of-the-art related to blockchain and decentralization technologies, since many have evolved quite fast lately. So this is the start of DecentraWise! Will bring some friends in… it’s good to have other people to share this journey with. Looking forward to what will come next. Cheers, PRC","categories":[{"name":"team","slug":"team","permalink":"https://decentrawise.com/categories/team/"}],"tags":[{"name":"beginning","slug":"beginning","permalink":"https://decentrawise.com/tags/beginning/"},{"name":"decentrawise","slug":"decentrawise","permalink":"https://decentrawise.com/tags/decentrawise/"}]}],"categories":[{"name":"development","slug":"development","permalink":"https://decentrawise.com/categories/development/"},{"name":"infrastructure","slug":"infrastructure","permalink":"https://decentrawise.com/categories/infrastructure/"},{"name":"market","slug":"market","permalink":"https://decentrawise.com/categories/market/"},{"name":"talks","slug":"talks","permalink":"https://decentrawise.com/categories/talks/"},{"name":"team","slug":"team","permalink":"https://decentrawise.com/categories/team/"}],"tags":[{"name":"projects","slug":"projects","permalink":"https://decentrawise.com/tags/projects/"},{"name":"dsound","slug":"dsound","permalink":"https://decentrawise.com/tags/dsound/"},{"name":"music","slug":"music","permalink":"https://decentrawise.com/tags/music/"},{"name":"ipfs","slug":"ipfs","permalink":"https://decentrawise.com/tags/ipfs/"},{"name":"hive","slug":"hive","permalink":"https://decentrawise.com/tags/hive/"},{"name":"steem","slug":"steem","permalink":"https://decentrawise.com/tags/steem/"},{"name":"witness","slug":"witness","permalink":"https://decentrawise.com/tags/witness/"},{"name":"bp","slug":"bp","permalink":"https://decentrawise.com/tags/bp/"},{"name":"dpos","slug":"dpos","permalink":"https://decentrawise.com/tags/dpos/"},{"name":"eosio","slug":"eosio","permalink":"https://decentrawise.com/tags/eosio/"},{"name":"smart-contract","slug":"smart-contract","permalink":"https://decentrawise.com/tags/smart-contract/"},{"name":"efficiency","slug":"efficiency","permalink":"https://decentrawise.com/tags/efficiency/"},{"name":"testing","slug":"testing","permalink":"https://decentrawise.com/tags/testing/"},{"name":"dtube","slug":"dtube","permalink":"https://decentrawise.com/tags/dtube/"},{"name":"token","slug":"token","permalink":"https://decentrawise.com/tags/token/"},{"name":"blockchain","slug":"blockchain","permalink":"https://decentrawise.com/tags/blockchain/"},{"name":"panel","slug":"panel","permalink":"https://decentrawise.com/tags/panel/"},{"name":"decentralization","slug":"decentralization","permalink":"https://decentrawise.com/tags/decentralization/"},{"name":"dapps","slug":"dapps","permalink":"https://decentrawise.com/tags/dapps/"},{"name":"beginning","slug":"beginning","permalink":"https://decentrawise.com/tags/beginning/"},{"name":"decentrawise","slug":"decentrawise","permalink":"https://decentrawise.com/tags/decentrawise/"}]}